#include <stdio.h>
//二维数组
int main() {
    /* 数据类型 arr[m][n] = {
        {
            1, 2, 3, 4, 5
        },
        {
            1, 2, 3, 4, 5
        }
    };

    //遍历：
    索引
    指针
     */
    int arr[2][5] = {
        {
            1, 2, 3, 4, 5
        },
        {
            6, 7, 8, 9, 10
        }
    };
    //利用指针遍历二维数组
    //数组指针的数据类型:要跟数组内部元素的类型保持一致
    //二维数组里面存储的是一维数组int[5]
    int (*p)[5] = arr;
    for (int i = 0; i < 2; ++i) {
        for (int j = 0; j < 5; ++j) {
            printf("%d", *(*p + j));
        }
        printf("\n");
        //移动二维数组的指针
        ++p;
    }
}
